gicking/STM8_headers/SVD/STM8S208M8.svd
      </registers>
      <interrupt>
        <name>Interrupt_IRQ2</name>
        <description>Interrupt_IRQ2 interrupt</description>
        <value>2</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <baseAddress>0x50E0</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>3</size>
        <usage>registers</usage>
      </addressBlock>
      <description>IWDG</description>
      <groupName>Watchdog</groupName>
      <registers>
        <register>
          <name>KR</name>
          <description>IWDG key register</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>IWDG prescaler register</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <description>IWDG reload register</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>RL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OPT</name>
      <baseAddress>0x4800</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>11</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000d</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x007e</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <description>OPT</description>
      <groupName>Option-Bytes</groupName>
      <registers>
        <register>
          <name>OPT0</name>
          <description>Read-out protection (ROP)</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT1</name>
          <description>User boot code (UBC)</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT1</name>
          <description>User boot code (UBC) (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT2</name>
          <description>Alternate function remapping (AFR)</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT2</name>
          <description>Alternate function remapping (AFR) (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT3</name>
          <description>Misc. option</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT3</name>
          <description>Misc. option (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT4</name>
          <description>Clock option</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT4</name>
          <description>Clock option (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT5</name>
          <description>HSE clock startup</description>
          <size>8</size>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT5</name>
          <description>HSE clock startup (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT7</name>
          <description>Flash wait states</description>
          <size>8</size>
          <addressOffset>0x000D</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT7</name>
          <description>Flash wait states (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x000E</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPTBL</name>
          <description>Bootloader</description>
          <size>8</size>
          <addressOffset>0x007E</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPTBL</name>
          <description>Bootloader (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x007F</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
